app/controllers/school_classes_controller.rb

  def create
    school_class = SchoolClass.new(params.require(:school_class).permit(:title,:room_number))
    school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2019-07-01 19:01:38.029404"], ["updated_at", "2019-07-01 19:01:38.029404"]]

  def update
    school_class = SchoolClass.find(params[:id])
    school_class.update(params.require(:school_class).permit(:title,:room_number))
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-07-01 19:15:24.149377"], ["id", 1]]