app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["created_at", "2019-07-01 18:19:56.152161"], ["updated_at", "2019-07-01 18:19:56.152161"]]
---
    def create
      student = Student.new(student_params(:first_name,:last_name))
      student.save

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-07-01 18:31:39.614057"], ["id", 1]]
---
    def update
      student = Student.find(params[:id])
      student.update(student_params(:first_name,:last_name))